"""Модули и пакеты"""


# Модуль - файл, содержащий код питона (расширение - .py). Имя файла без расширения - это название модуля (содержит в себе функци, переменные, классы)

#Почти все пакеты на питон есть на сайте   PyPI

# Пакет - папка/каталог с модулями, другими пакетами и файл __init__.py. (его наличие позволяет интерпритатору понять, что перед ним пакет)

"""команды для импорта"""

#1. import .... -> грубо говоря импортируем весь модуль 

#2. from ... import ... ->  частично что-то импортируем

#можно использовать as -> import random as rand

"""синтаксис"""

#from пакет.модуль import функцию  

# import file_module

# file_module.sum_file(3,3)
# file_module.read_sum()
# print(dir(file_module))
# from my_package import hello

#print(hello.hello)

# from my_package.hello import hello

# print(hello)



